xiongyumail/esp32-s2beta-hmi/project/camera/components/esp32-camera/driver/camera_32s2.c
fail:
    while (_fb) {
        _fb2 = _fb;
        _fb = _fb->next;
        free(_fb2->buf);
        free(_fb2);
    }
    return ESP_ERR_NO_MEM;
}

#define FRAM_WIDTH

static esp_err_t dma_desc_init()
{
    assert(s_state->width % 4 == 0);
    size_t line_size = s_state->width * s_state->in_bytes_per_pixel *
                       i2s_bytes_per_sample(s_state->sampling_mode);
    ESP_LOGD(TAG, "Line width (for DMA): %d bytes", line_size);
    size_t dma_per_line = 1;
    size_t buf_size = line_size;
    while (buf_size >= 4096) {
        buf_size /= 2;
        dma_per_line *= 2;
    }
    size_t dma_desc_count = dma_per_line * 4;
    s_state->dma_buf_width = line_size;
    s_state->dma_per_line = dma_per_line;
    s_state->dma_desc_count = dma_desc_count;
    ESP_LOGD(TAG, "DMA buffer size: %d, DMA buffers per line: %d", buf_size, dma_per_line);
    ESP_LOGD(TAG, "DMA buffer count: %d", dma_desc_count);
    ESP_LOGD(TAG, "DMA buffer total: %d bytes", buf_size * dma_desc_count);

    s_state->dma_buf = (dma_elem_t**) malloc(sizeof(dma_elem_t*) * dma_desc_count);
    if (s_state->dma_buf == NULL) {
        return ESP_ERR_NO_MEM;
    }
    s_state->dma_desc = (lldesc_t*) malloc(sizeof(lldesc_t) * dma_desc_count);
    if (s_state->dma_desc == NULL) {
        return ESP_ERR_NO_MEM;
    }
    size_t dma_sample_count = 0;
    for (int i = 0; i < dma_desc_count; ++i) {
        ESP_LOGD(TAG, "Allocating DMA buffer #%d, size=%d", i, buf_size);
        dma_elem_t* buf = (dma_elem_t*) malloc(buf_size);
        if (buf == NULL) {
            return ESP_ERR_NO_MEM;
        }
        s_state->dma_buf[i] = buf;
        ESP_LOGV(TAG, "dma_buf[%d]=%p", i, buf);

        lldesc_t* pd = &s_state->dma_desc[i];
        pd->length = buf_size;
        if (s_state->sampling_mode == SM_0A0B_0B0C &&
                (i + 1) % dma_per_line == 0) {
            pd->length -= 4;
        }
        dma_sample_count += pd->length / 4;
        pd->size = pd->length;
        pd->owner = 1;
        pd->sosf = 1;
        pd->buf = (uint8_t*) buf;
        pd->offset = 0;
        pd->empty = 0;
        pd->eof = 1;
        pd->qe.stqe_next = &s_state->dma_desc[(i + 1) % dma_desc_count];
    }
    s_state->dma_sample_count = dma_sample_count;
    return ESP_OK;
}

static void dma_desc_deinit()
{
    if (s_state->dma_buf) {
        for (int i = 0; i < s_state->dma_desc_count; ++i) {
            free(s_state->dma_buf[i]);
        }
    }
    free(s_state->dma_buf);
    free(s_state->dma_desc);
}

static inline void IRAM_ATTR i2s_conf_reset()
{
    I2S0.lc_conf.in_rst  = 1;
    I2S0.lc_conf.in_rst  = 0;
    I2S0.lc_conf.ahbm_fifo_rst = 1;
    I2S0.lc_conf.ahbm_fifo_rst = 0;
    I2S0.lc_conf.ahbm_rst = 1;
    I2S0.lc_conf.ahbm_rst = 0;

    I2S0.conf.rx_reset = 1;
    I2S0.conf.rx_reset = 0;
    I2S0.conf.rx_fifo_reset = 1;
    I2S0.conf.rx_fifo_reset = 0;
    while ( GET_PERI_REG_MASK(I2S_CONF_REG(0), I2S_RX_FIFO_RESET_ST_M) );
}

#define DATA_SIG_OFFSET (8)

static lldesc_t _dma = {0};

static void i2s_dma_start_tmp(void)
{

    _dma.size = 1024 * 3;
    _dma.length = 1024 * 3;
    _dma.eof = 1;
    _dma.owner = 1;
    _dma.buf = malloc(1024 * 3);
    _dma.empty = NULL;
    if (_dma.buf == NULL) printf("malloc fail\n");
    I2S0.in_link.addr = ((uint32_t)&_dma) & 0xfffff;
    I2S0.rx_eof_num = 1024;
    I2S0.conf2.cam_sync_fifo_reset = 0;
    I2S0.fifo_conf.dscr_en = 1;
    I2S0.in_link.start = 1;
    I2S0.conf.rx_start = 1;
    I2S0.int_clr.in_suc_eof = 1;
    I2S0.int_ena.in_suc_eof = 1;
    gpio_matrix_in(0x38, I2S0I_H_ENABLE_IDX, false);
    ets_printf("camera start\n");
    while (1) {
        // printf("iintraw %x\n", I2S0.int_raw.val);
        ;
    }
}

void _i2s_isr(void)
{
    ets_printf("suc eof\n");
}

#define D0 GPIO_NUM_18
#define D1 GPIO_NUM_21
#define D2 GPIO_NUM_17
#define D3 GPIO_NUM_7
#define D4 GPIO_NUM_8
#define D5 GPIO_NUM_9
#define D6 GPIO_NUM_10
#define D7 GPIO_NUM_11

#define XCLK  GPIO_NUM_0
#define PCLK  GPIO_NUM_12
#define VSYNC GPIO_NUM_14
#define HSYNC GPIO_NUM_13
static int  SIG_OFFSET = 8;

static void camera_pin_cfg(void)
{
    printf("camera pin cfg\n");
    gpio_matrix_in(0x30, I2S0I_H_ENABLE_IDX, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[HSYNC], PIN_FUNC_GPIO);
    gpio_set_direction(HSYNC, GPIO_MODE_INPUT);
    gpio_matrix_in(HSYNC, I2S0I_H_SYNC_IDX, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[VSYNC], PIN_FUNC_GPIO);
    gpio_set_direction(VSYNC, GPIO_MODE_INPUT);
    gpio_matrix_in(VSYNC, I2S0I_V_SYNC_IDX, true);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[PCLK], PIN_FUNC_GPIO);
    gpio_set_direction(PCLK, GPIO_MODE_INPUT);
    gpio_set_pull_mode(PCLK, GPIO_PULLUP_ONLY);
    gpio_matrix_in(PCLK, I2S0I_WS_IN_IDX, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D0], PIN_FUNC_GPIO);
    gpio_set_direction(D0, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D0, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D0, I2S0I_DATA_IN0_IDX + SIG_OFFSET, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D1], PIN_FUNC_GPIO);
    gpio_set_direction(D1, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D1, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D1, I2S0I_DATA_IN1_IDX + SIG_OFFSET, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D2], PIN_FUNC_GPIO);
    gpio_set_direction(D2, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D2, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D2, I2S0I_DATA_IN2_IDX + SIG_OFFSET, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D3], PIN_FUNC_GPIO);
    gpio_set_direction(D3, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D3, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D3, I2S0I_DATA_IN3_IDX + SIG_OFFSET, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D4], PIN_FUNC_GPIO);
    gpio_set_direction(D4, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D4, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D4, I2S0I_DATA_IN4_IDX + SIG_OFFSET, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D5], PIN_FUNC_GPIO);
    gpio_set_direction(D5, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D5, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D5, I2S0I_DATA_IN5_IDX + SIG_OFFSET, false);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D6], PIN_FUNC_GPIO);
    gpio_set_direction(D6, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D6, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D6, I2S0I_DATA_IN6_IDX + SIG_OFFSET, false);

