xiongyumail/esp32-s2beta-hmi/project/camera/components/esp32-camera/driver/camera_32s2.c
    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[D7], PIN_FUNC_GPIO);
    gpio_set_direction(D7, GPIO_MODE_INPUT);
    gpio_set_pull_mode(D7, GPIO_PULLUP_ONLY);
    gpio_matrix_in(D7, I2S0I_DATA_IN7_IDX + SIG_OFFSET, false);
}

static void i2s_init()
{
    camera_config_t* config = &s_state->config;

    // Configure input GPIOs
    gpio_num_t pins[] = {
        config->pin_d7,
        config->pin_d6,
        config->pin_d5,
        config->pin_d4,
        config->pin_d3,
        config->pin_d2,
        config->pin_d1,
        config->pin_d0,
        config->pin_vsync,
        config->pin_href,
        config->pin_pclk
    };
    gpio_config_t conf = {
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    for (int i = 0; i < sizeof(pins) / sizeof(gpio_num_t); ++i) {
        if (rtc_gpio_is_valid_gpio(pins[i])) {
            rtc_gpio_deinit(pins[i]);
        }
        conf.pin_bit_mask = 1LL << pins[i];
        gpio_config(&conf);
    }

    // Route input GPIOs to I2S peripheral using GPIO matrix
    gpio_matrix_in(config->pin_d0, I2S0I_DATA_IN0_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d1, I2S0I_DATA_IN1_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d2, I2S0I_DATA_IN2_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d3, I2S0I_DATA_IN3_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d4, I2S0I_DATA_IN4_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d5, I2S0I_DATA_IN5_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d6, I2S0I_DATA_IN6_IDX + DATA_SIG_OFFSET, false);
    gpio_matrix_in(config->pin_d7, I2S0I_DATA_IN7_IDX + DATA_SIG_OFFSET, false);

    gpio_matrix_in(0x30, I2S0I_H_ENABLE_IDX, false);
    gpio_matrix_in(config->pin_href, I2S0I_H_SYNC_IDX, false);
    gpio_matrix_in(config->pin_vsync, I2S0I_V_SYNC_IDX, true);
    gpio_matrix_in(config->pin_pclk, I2S0I_WS_IN_IDX, false);
    // Enable and configure I2S peripheral
    periph_module_enable(PERIPH_I2S0_MODULE);
    // Toggle some reset bits in LC_CONF register
    // Toggle some reset bits in CONF register

    I2S0.clkm_conf.val = 0;
    I2S0.clkm_conf.clkm_div_num = 2;
    I2S0.clkm_conf.clkm_div_b = 0;
    I2S0.clkm_conf.clkm_div_a = 0;
    I2S0.clkm_conf.clk_sel = 2;
    I2S0.clkm_conf.clk_en = 1;

    I2S0.conf.val = 0;
    I2S0.conf1.val = 0;
    I2S0.conf1.rx_pcm_bypass = 1;
    I2S0.sample_rate_conf.val = 0;
    I2S0.sample_rate_conf.rx_bck_div_num = 4;
    I2S0.timing.val = 0;
    I2S0.conf2.val = 0;
    I2S0.fifo_conf.val = 0;
    I2S0.fifo_conf.rx_fifo_mod_force_en = 1;
    I2S0.fifo_conf.rx_data_num = 32;
    I2S0.conf.rx_right_first = 1;
    I2S0.conf.rx_dma_equal = 1;

    I2S0.conf2.lcd_en = 1;
    I2S0.conf2.camera_en = 1;
    I2S0.conf2.cam_clk_loopback = 0;
    I2S0.conf2.i_v_sync_filter_en = 1;
    I2S0.conf2.i_v_sync_filter_thres = 1;
    I2S0.fifo_conf.rx_data_num = 32;
    I2S0.sample_rate_conf.rx_bits_mod = 8;
    I2S0.fifo_conf.rx_fifo_mod = 1;
    I2S0.conf_chan.rx_chan_mod = 1;

    i2s_conf_reset();

    I2S0.conf2.cam_sync_fifo_reset = 1;
    I2S0.int_ena.val = 0;
    I2S0.int_clr.val = ~0;

    // Allocate I2S interrupt, keep it disabled
    // esp_intr_alloc(ETS_I2S0_INTR_SOURCE,
    //                ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_IRAM,
    //                &_i2s_isr, NULL, &s_state->i2s_intr_handle);
    esp_intr_alloc(ETS_I2S0_INTR_SOURCE, 0, _i2s_isr, NULL, &s_state->i2s_intr_handle);
}

static void IRAM_ATTR i2s_start_bus()
{
    s_state->dma_desc_cur = 0;
    s_state->dma_received_count = 0;
    //s_state->dma_filtered_count = 0;
    esp_intr_disable(s_state->i2s_intr_handle);
    i2s_conf_reset();
    I2S0.int_ena.val = 0;
    I2S0.int_clr.val = ~0;
    I2S0.rx_eof_num = 32;//s_state->dma_sample_count;
    I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[0];
    I2S0.in_link.start = 1;
    I2S0.conf.rx_start = 1;
    esp_intr_enable(s_state->i2s_intr_handle);
    I2S0.int_ena.in_suc_eof = 1;
    if (s_state->config.pixel_format == PIXFORMAT_JPEG) {
        vsync_intr_enable();
    }
}

static int i2s_run()
{
    for (int i = 0; i < s_state->dma_desc_count; ++i) {
        lldesc_t* d = &s_state->dma_desc[i];
        ESP_LOGV(TAG, "DMA desc %2d: %u %u %u %u %u %u %p %p",
                 i, d->length, d->size, d->offset, d->eof, d->sosf, d->owner, d->buf, d->qe.stqe_next);
        memset(s_state->dma_buf[i], 0, d->length);
    }

    // wait for frame
    camera_fb_int_t * fb = s_state->fb;
    while (s_state->config.fb_count > 1) {
        while (s_state->fb->ref && s_state->fb->next != fb) {
            s_state->fb = s_state->fb->next;
        }
        if (s_state->fb->ref == 0) {
            break;
        }
        vTaskDelay(2);
    }
    printf("start bus\n");
    i2s_start_bus();
    return 0;
}

static void IRAM_ATTR i2s_stop_bus()
{
    esp_intr_disable(s_state->i2s_intr_handle);
    vsync_intr_disable();
    i2s_conf_reset();
    I2S0.conf.rx_start = 0;
}

static void IRAM_ATTR i2s_stop(bool* need_yield)
{
    if (s_state->config.fb_count == 1 && !s_state->fb->bad) {
        i2s_stop_bus();
    } else {
        s_state->dma_received_count = 0;
    }

    size_t val = SIZE_MAX;
    BaseType_t higher_priority_task_woken;
    BaseType_t ret = xQueueSendFromISR(s_state->data_ready, &val, &higher_priority_task_woken);
    if (need_yield && !*need_yield) {
        *need_yield = (ret == pdTRUE && higher_priority_task_woken == pdTRUE);
    }
}

static void IRAM_ATTR signal_dma_buf_received(bool* need_yield)
{
    size_t dma_desc_filled = s_state->dma_desc_cur;
    s_state->dma_desc_cur = (dma_desc_filled + 1) % s_state->dma_desc_count;
    s_state->dma_received_count++;
    if (!s_state->fb->ref && s_state->fb->bad) {
        *need_yield = false;
        return;
    }
    BaseType_t higher_priority_task_woken;
    BaseType_t ret = xQueueSendFromISR(s_state->data_ready, &dma_desc_filled, &higher_priority_task_woken);
    if (ret != pdTRUE) {
        if (!s_state->fb->ref) {
            s_state->fb->bad = 1;
        }
        //ESP_EARLY_LOGW(TAG, "qsf:%d", s_state->dma_received_count);
        //ets_printf("qsf:%d\n", s_state->dma_received_count);
    }
    *need_yield = (ret == pdTRUE && higher_priority_task_woken == pdTRUE);
}

static void IRAM_ATTR i2s_isr(void* arg)
{
    I2S0.int_clr.val = I2S0.int_raw.val;
    bool need_yield = false;
    signal_dma_buf_received(&need_yield);
    if (s_state->config.pixel_format != PIXFORMAT_JPEG
            && s_state->dma_received_count == s_state->height * s_state->dma_per_line) {
        i2s_stop(&need_yield);
    }
    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR vsync_isr(void* arg)
{
    GPIO.status1_w1tc.val = GPIO.status1.val;
    GPIO.status_w1tc = GPIO.status;
    bool need_yield = false;
    //if vsync is low and we have received some data, frame is done
    if (_gpio_get_level(s_state->config.pin_vsync) == 0) {
        if (s_state->dma_received_count > 0) {
            signal_dma_buf_received(&need_yield);
            // ets_printf("end_vsync\n");
            if (s_state->dma_filtered_count > 1 || s_state->config.fb_count > 1) {
                i2s_stop(&need_yield);
            }
        }
        if (s_state->config.fb_count > 1 || s_state->dma_filtered_count < 2) {
            I2S0.conf.rx_start = 0;
            I2S0.in_link.start = 0;
            I2S0.int_clr.val = I2S0.int_raw.val;
            i2s_conf_reset();
            s_state->dma_desc_cur = (s_state->dma_desc_cur + 1) % s_state->dma_desc_count;
            //I2S0.rx_eof_num = s_state->dma_sample_count;
            I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[s_state->dma_desc_cur];
            I2S0.in_link.start = 1;
            I2S0.conf.rx_start = 1;
            s_state->dma_received_count = 0;
        }
    }
    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR camera_fb_done()
{
    camera_fb_int_t * fb = NULL, * fb2 = NULL;
    BaseType_t taskAwoken = 0;

